package com.javarush.test.level03.lesson04.task01;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

public class Solution
{
    public static void main(String[] args)
    {
        String a = "NOV";//напишите тут ваш код
        int b = 11;//напишите тут ваш код
        int c = 1980;//напишите тут ваш код
        System.out.println(a+" "+b+" "+c);
    }
}